[
  {
    "id": "prod-1",
    "name": "Azure Dream Vase",
    "artisanId": "art-1",
    "categoryId": "pottery",
    "price": 85,
    "rating": 4.8,
    "reviewCount": 124,
    "description": "A hand-thrown stoneware vase, glazed in a deep, vibrant azure that evokes the summer sky. Each piece is unique, with slight variations in color and form that speak to its handmade nature.",
    "story": "Elena sculpted this vase during a quiet sunrise, inspired by the shifting colors of the dawn. It's meant to hold a piece of the outdoors, bringing tranquility and nature's beauty into your home.",
    "imageIds": [
      "product-ceramic-vase",
      "gallery-1"
    ]
  },
  {
    "id": "prod-2",
    "name": "Forest-Heart Bowl",
    "artisanId": "art-2",
    "categoryId": "woodwork",
    "price": 120,
    "rating": 4.9,
    "reviewCount": 98,
    "description": "Carved from a single piece of sustainably sourced maple, this bowl features a live edge that follows the natural contour of the tree. It is finished with a food-safe oil to highlight the wood's rich grain.",
    "story": "Samuel believes every piece of wood has a story. This bowl comes from a fallen maple in a local forest. He worked to preserve its spirit, creating a functional piece of art that connects you to the woods.",
    "imageIds": [
      "product-wooden-bowl",
      "gallery-2"
    ]
  },
  {
    "id": "prod-3",
    "name": "Sunset Weaver Scarf",
    "artisanId": "art-3",
    "categoryId": "textiles",
    "price": 65,
    "rating": 4.7,
    "reviewCount": 210,
    "description": "A lightweight and incredibly soft scarf, hand-woven from a blend of merino wool and silk. The colors transition from warm orange to deep indigo, mirroring a desert sunset.",
    "story": "Aisha's weaving is a form of meditation. The pattern of this scarf is a traditional design from her village, passed down through generations. Each thread is a word in a story of heritage and warmth.",
    "imageIds": [
      "product-woven-scarf",
      "gallery-3"
    ]
  },
  {
    "id": "prod-4",
    "name": "Tidal Moon Necklace",
    "artisanId": "art-4",
    "categoryId": "jewelry",
    "price": 150,
    "rating": 4.9,
    "reviewCount": 75,
    "description": "A minimalist sterling silver necklace featuring a hammered crescent moon pendant and a small, shimmering moonstone. The chain is delicate yet strong, perfect for everyday wear.",
    "story": "Marco is fascinated by the cosmos. This necklace is his interpretation of the moon's pull on the tides. The hammered texture catches the light like moonlight on water, a small piece of the night sky to carry with you.",
    "imageIds": [
      "product-silver-necklace",
      "gallery-4"
    ]
  },
  {
    "id": "prod-5",
    "name": "The Story-Keeper Journal",
    "artisanId": "art-2",
    "categoryId": "woodwork",
    "price": 75,
    "rating": 4.8,
    "reviewCount": 150,
    "description": "A rustic, refillable journal bound in supple, full-grain leather and hand-stitched with durable waxed linen thread. Features 200 pages of high-quality, acid-free paper.",
    "story": "Samuel also works with leather, seeing it as another natural canvas. He designed this journal to be a lifelong companion, aging beautifully and collecting stories alongside its owner.",
    "imageIds": [
      "product-leather-journal",
      "gallery-5"
    ]
  },
  {
    "id": "prod-6",
    "name": "Nebula Sculpture",
    "artisanId": "art-1",
    "categoryId": "pottery",
    "price": 220,
    "rating": 5,
    "reviewCount": 30,
    "description": "A unique, hand-blown glass sculpture capturing the ethereal beauty of a distant nebula. Swirls of vibrant color are suspended in clear glass, creating a sense of depth and wonder.",
    "story": "Though known for pottery, Elena has a passion for glassblowing. This piece is from her 'Cosmos' series, an exploration of form and color inspired by deep space imagery. It's a reminder of the vast beauty that exists beyond our world.",
    "imageIds": [
      "product-glass-sculpture",
      "gallery-6"
    ]
  },
  {
    "id": "prod-1758284377211",
    "name": "Coding Canvas: Your Handcrafted Path to JavaScript Mastery",
    "artisanId": "art-1758280547422",
    "categoryId": "new",
    "price": 107,
    "rating": 0,
    "reviewCount": 0,
    "description": "Step into the elegantly structured world of digital creation with our 'Coding Canvas' learning journey. This meticulously curated teaching tool is not merely a collection of lessons, but a vibrant tapestry woven from clear explanations, practical examples, and engaging visual aids. Each module is polished to perfection, ensuring a seamless flow of knowledge, presented in a clean, intuitive interface designed for optimal learning and retention. We've poured over every 'pixel' of content, ensuring that the 'materials' – the core concepts of JavaScript and DOM manipulation – are robust, accessible, and beautifully interconnected, much like the finest threads in a master weaver's work.\r\n\r\nThe inspiration for 'Coding Canvas' sprang from a deep desire to demystify the art of programming, transforming complex code into an approachable, joyful craft. Like a potter shaping clay, our expert instructors have patiently molded each lesson, drawing upon years of hands-on experience and a passion for sharing knowledge. We believe that true understanding blossoms from clear guidance and genuine encouragement. This course is our heartfelt offering, born from countless hours of refining, testing, and imagining a learning experience that feels less like a task and more like a discovery—a personal mentorship distilled into an accessible, artisan-crafted educational journey.",
    "story": "Inspired by teaching tool, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758284377208-338",
      "prod-img-1758284377210-609",
      "prod-img-1758284377211-329"
    ]
  },
  {
    "id": "prod-1758284571028",
    "name": "Heirloom Artisan Learning Blocks: A Tactile Path to Discovery",
    "artisanId": "art-1758280547422",
    "categoryId": "new",
    "price": 119,
    "rating": 0,
    "reviewCount": 0,
    "description": "Discover our exquisite set of Heirloom Artisan Learning Blocks, each piece a testament to enduring craftsmanship and thoughtful design. Meticulously hand-carved from sustainably sourced, premium maple wood, these blocks offer a wonderfully smooth, tactile experience, showcasing a rich, natural grain. Each surface is carefully etched with elegant letters, numbers, or symbols, rendered in a classic, legible typeface, ensuring both aesthetic beauty and educational clarity. A gentle, non-toxic beeswax finish protects the wood, imparting a soft, natural luster that promises durability for generations of inquisitive hands.\r\n\r\nConceived in our dedicated workshop, this collection draws inspiration from time-honored educational philosophies and the profound joy of foundational learning. We believe that true understanding blossoms through engagement, and the hands-on interaction with these heirloom-quality blocks is designed to ignite curiosity, foster problem-solving skills, and deepen a child's connection to the world of knowledge. Each set is lovingly crafted not just as a teaching tool, but as a cherished family treasure, destined to be passed down, carrying forward a legacy of discovery and intellectual growth.",
    "story": "Inspired by teaching tool, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758284570968-213",
      "prod-img-1758284570988-551",
      "prod-img-1758284571028-667"
    ]
  },
  {
    "id": "prod-1758398800049",
    "name": "The Artisan Coder's Blueprint: Handcrafted Java & JavaScript Mastery",
    "artisanId": "art-1758398167859",
    "categoryId": "new",
    "price": 55,
    "rating": 0,
    "reviewCount": 0,
    "description": "Embark on a meticulously crafted digital journey designed to illuminate the art of programming. This comprehensive learning experience unfolds like a carefully curated collection, offering polished insights into both Java and JavaScript. Each module is a testament to clarity, breaking down intricate concepts from essential loops to dynamic DOM manipulation with visual elegance and accessible explanations, much like a master craftsman reveals the secrets of their trade.\r\n\r\nInspired by the profound satisfaction of guiding aspiring creators, this teaching resource was conceived to transform complex code into intuitive understanding. We believe in fostering a deep connection with the logic behind the syntax, patiently guiding you through challenges to cultivate genuine coding confidence. It's an invitation to develop not just skills, but a true artisan's appreciation for the elegance and power of well-structured software.",
    "story": "Inspired by teaching, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758398800047-550",
      "prod-img-1758398800047-917",
      "prod-img-1758398800049-662"
    ]
  },
  {
    "id": "prod-1758453172370",
    "name": "The Artisan's Toolkit of Knowledge | Hand-Drawn Learning Essentials",
    "artisanId": "art-1758450929862",
    "categoryId": "new",
    "price": 36,
    "rating": 0,
    "reviewCount": 0,
    "description": "Crafted with a delicate hand, this digital illustration captures the timeless essence of learning through its minimalist line art. Each iconic tool – from the inquisitive magnifying glass and the open book of wisdom, to the precise geometry of the ruler and compass, and the ever-present eraser for thoughtful revision – is rendered with crisp, elegant strokes. This versatile design offers a clean aesthetic, ready to inspire on any medium you choose, whether gracing a fine art print or adorning a bespoke handcrafted item.\r\n\r\nMy inspiration for this piece sprang from the quiet moments of reflection on the profound journey of education – both as a student and as a lifelong learner. I envisioned a tribute to the dedicated educators and curious minds who shape our world, meticulously sketching each element with the reverence they deserve. It's a reminder that true understanding comes from exploration, measurement, correction, and boundless curiosity, born from a desire to celebrate the enduring beauty found in the pursuit of knowledge.",
    "story": "Inspired by teaching, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1758453172370-574",
      "prod-img-1758453172370-90",
      "prod-img-1758453172370-58"
    ]
  },
  {
    "id": "prod-1759989644049",
    "name": "The Artisan's Roadmap: Crafting Your Path to Top Tech Placements",
    "artisanId": "art-1759988986381",
    "categoryId": "new",
    "price": 84,
    "rating": 0,
    "reviewCount": 0,
    "description": "Discover a meticulously curated digital study companion, designed with the precision of a master artisan. This comprehensive roadmap unfolds through insightful video modules, presenting complex career pathways with unparalleled clarity. Each lesson is a carefully polished gem of wisdom, offering a crystal-clear view into the hiring landscapes of leading service-based tech companies like TCS, Infosys, Wipro, and Accenture, ensuring every aspiring professional finds their footing with confidence.\r\n\r\nBorn from a deep understanding of industry nuances and a heartfelt desire to empower aspiring talent, this guide is more than just information; it's a legacy of mentorship. Inspired by countless journeys and the shared ambition of those seeking their first significant career step, it was crafted not merely as a course, but as a guiding light—a testament to the belief that every dream deserves a clear, actionable path, built with dedication and an unwavering commitment to your success.",
    "story": "Inspired by study-tool, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1759989644046-950",
      "prod-img-1759989644049-704",
      "prod-img-1759989644049-371"
    ]
  },
  {
    "id": "prod-1759990051438",
    "name": "The Artisan's Code: Masterful Programming Journeys",
    "artisanId": "art-1759988986381",
    "categoryId": "new",
    "price": 71,
    "rating": 0,
    "reviewCount": 0,
    "description": "Embark on a meticulously crafted educational journey where the art of coding comes to life. Our modules are thoughtfully designed, presenting complex programming concepts in digestible steps, much like a skilled artisan carefully sculpts their masterpiece. You'll delve into engaging tutorials, interactive coding challenges reminiscent of HackerRank, and crystal-clear explanations across languages like Java and JavaScript, all curated to build a robust and intuitive foundation in programming logic.\r\n\r\nThis unique teaching approach was born from a profound passion to demystify the digital realm and empower aspiring developers with genuine skill. Witnessing the 'aha!' moment when a concept clicks, or a student successfully debugs their first intricate line of code, is the driving force behind our dedication. We believe coding is not just about syntax; it's about creative problem-solving and the sheer joy of bringing ideas to fruition, a philosophy we carefully infuse into every lesson we craft.",
    "story": "Inspired by coding-teaching, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1759990051436-728",
      "prod-img-1759990051436-214",
      "prod-img-1759990051438-294"
    ]
  },
  {
    "id": "prod-1759990544024",
    "name": "The Coder's Compass: Navigating Your Digital Craft with Expert Guidance",
    "artisanId": "art-1759988986381",
    "categoryId": "new",
    "price": 104,
    "rating": 0,
    "reviewCount": 0,
    "description": "Embark on a meticulously crafted learning adventure designed to illuminate the complex world of coding. Our digital offerings are not just tutorials; they are curated pathways, built with clarity and precision, guiding you through fundamental concepts and advanced techniques. Each lesson, presented with engaging visuals and articulate explanations, forms the bedrock of your programming proficiency, turning intricate code into understandable building blocks.\r\n\r\nBorn from a genuine passion for demystifying technology and empowering aspiring developers, this educational journey is the culmination of years of experience and a deep understanding of common learning hurdles. We believe that learning to code is akin to mastering a new craft, requiring patience, dedication, and the right tools. Our inspiration stems from witnessing the transformative power of coding and a desire to share that magic, ensuring every student feels supported and confident in their pursuit of digital excellence.",
    "story": "Inspired by coding-teaching, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1759990544021-615",
      "prod-img-1759990544022-1",
      "prod-img-1759990544024-526"
    ]
  },
  {
    "id": "prod-1759992848570",
    "name": "The Coder's Milestone Star Tracker",
    "artisanId": "art-1759988986381",
    "categoryId": "new",
    "price": 20,
    "rating": 0,
    "reviewCount": 0,
    "description": "Crafted from select, sustainably sourced walnut, our Coder's Milestone Star Tracker is a testament to the journey of every dedicated developer. Each piece is hand-sanded to a silken finish, revealing the wood's natural grain, and then etched with subtle patterns reminiscent of ancient algorithms and modern circuit pathways. Embedded within its elegant design are polished brass star receptacles, awaiting the luminous acrylic stars earned on your coding quest, making each digital triumph a tangible beacon of progress. It's a striking addition to any workspace, a daily reminder of your dedication and growth.\r\nInspired by the exhilarating rush of finally solving that elusive bug or earning a 'Congratulations!' on a tough coding challenge, we set out to create a way to honor these digital victories in the physical world. This tracker was born from a desire to transform fleeting screen-based accolades into a permanent, inspiring display. It's an artisan's ode to the tireless hours, the creative problem-solving, and the sheer grit that defines the developer's path, offering a beautiful reminder of how far you've come and the stellar achievements yet to unlock.",
    "story": "Inspired by acheivement-tracker, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1759992848568-569",
      "prod-img-1759992848568-736",
      "prod-img-1759992848570-290"
    ]
  },
  {
    "id": "prod-1760163944686",
    "name": "Earthen Embrace Handcrafted Terracotta Water Carafe & Tumblers",
    "artisanId": "art-1760163862536",
    "categoryId": "new",
    "price": 92,
    "rating": 0,
    "reviewCount": 0,
    "description": "Discover the timeless elegance of our Earthen Embrace Water Carafe and Tumbler Set, meticulously handcrafted from natural, clayey pottery. Each piece boasts a warm, inviting terracotta hue and a beautifully smooth, tactile finish that connects you directly to the earth. The gracefully curved carafe, often accompanied by a matching lid, is designed not just for aesthetics but also to naturally cool your water, while the accompanying tumblers offer a comfortable, rustic grip for a truly refreshing experience.\r\n\r\nThis collection springs from a deep reverence for ancient craft and sustainable living. Inspired by generations of artisans who transformed simple earth into vessels of life, our pottery is a testament to the quiet beauty found in traditional methods. Every curve and contour tells a story of the artisan's hands, carefully shaping and firing the clay, infusing each piece with intention and soul, inviting you to slow down and savor the simple pleasure of natural hydration.",
    "story": "Inspired by clayey pottery, this piece is a new addition to my collection.",
    "imageIds": [
      "prod-img-1760163944685-585",
      "prod-img-1760163944685-447",
      "prod-img-1760163944686-22"
    ]
  }
]